Merge pull request #5 from Nishant-art27/nishant
Changed all raw diagrams to mermaid
